[{"model": "article.comment", "pk": 1, "fields": {"text": "jkdlsfjaf", "date": "2016-09-10T16:23:08.175Z", "user": 1, "article": 4}}, {"model": "article.comment", "pk": 2, "fields": {"text": "jfksjflasd", "date": "2016-09-10T18:43:22.441Z", "user": 1, "article": 8}}, {"model": "article.comment", "pk": 3, "fields": {"text": "jklsjlfsalfd", "date": "2016-09-10T18:43:26.442Z", "user": 1, "article": 8}}, {"model": "article.comment", "pk": 4, "fields": {"text": "jlkfjsldf", "date": "2016-09-10T18:43:45.749Z", "user": 1, "article": 8}}, {"model": "article.tag", "pk": 1, "fields": {"tag_name": "dingo"}}, {"model": "article.article", "pk": 1, "fields": {"title": "Настройка классов виджета", "text": "Для виджетов можно добавлять медиа файлы (css и javascript) для более глубокой настройки их внешнего вида и поведения.\r\n\r\nВкратце, вам потребуется унаследовать виджет и либо определить класс “Media”, либо создать свойство “media”, возвращающее экземпляр этого класса.\r\n\r\nЭти методы требуют некоторого объёма продвинутого кода и подробно описаны в руководстве по ресурсам форм.", "date": "2016-09-10T16:20:36Z", "likes": 0, "tags": [1]}}, {"model": "article.article", "pk": 2, "fields": {"title": "Основные классы виджетов", "text": "Основные классы виджетов Widget и MultiWidget унаследованы всеми встроенными виджетами и могут являться основой для ваших собственных виджетов.\r\n\r\nclass Widget(attrs=None)\r\nАбстрактный класс не может быть использован для отображения поля, но он предоставляет основной атрибут attrs. Вы также можете реализовать или переопределить метод render() в своём виджете.\r\n\r\nattrs\r\nСловарь, которые содержит HTML атрибуты, которые будут назначены сгенерированному виджету.\r\n\r\n>>> from django import forms\r\n>>> name = forms.TextInput(attrs={'size': 10, 'title': 'Your name',})\r\n>>> name.render('name', 'A name')\r\n'<input title=\"Your name\" type=\"text\" name=\"name\" value=\"A name\" size=\"10\" />'\r\nChanged in Django 1.8:\r\nЕсли вы укажите True или False атрибуту, он будет отрендерен как HTML5 булев атрибут:\r\n\r\n>>> name = forms.TextInput(attrs={'required': True})\r\n>>> name.render('name', 'A name')\r\n'<input name=\"name\" type=\"text\" value=\"A name\" required />'\r\n>>>\r\n>>> name = forms.TextInput(attrs={'required': False})\r\n>>> name.render('name', 'A name')\r\n'<input name=\"name\" type=\"text\" value=\"A name\" />'\r\nsupports_microseconds\r\nАтрибут по умолчанию равен True. При False микросекунды объекта datetime и time будут сброшены в 0.\r\n\r\nNew in Django 1.9:\r\nВ предыдущих версиях этот атрибут был доступен только для виджетов даты и времени (по умолчанию False).\r\n\r\nid_for_label(self, id_)\r\nВозвращает HTML ID атрибут виджета, который можно использовать для <label>, принимая ID поля. Возвращает None, если ID не доступен.\r\n\r\nЭтот метод необходим т.к. некоторые виджеты состоят из нескольких HTML элеентов с разными ID. В этом случает метод должен вернуть ID первого тега виджета.\r\n\r\nrender(name, value, attrs=None)\r\nВозвращает HTML для виджета в виде строки Unicode. Этот метод должен быть реализован в дочерних классах. В противном случае будет выброшено исключение NotImplementedError.\r\n\r\nНикто не гарантирует, что полученное значение будет правильным, поэтому реализация метода в дочерних классах должна обеспечивать соответствующую проверку.\r\n\r\nvalue_from_datadict(data, files, name)\r\nПринимает словарь с данными и имя виджета. files может содержать данные из request.FILES. Возвращает None, если значение не найдено. Обратите внимание, value_from_datadict может вызываться несколько раз при обработке данных в форме. Если вы добавите медленные операции в этот метод, позаботьтесь о кешировании результата.\r\n\r\nclass MultiWidget(widgets, attrs=None)\r\nВиджет, который состоит из множества виджетов. Класс MultiWidget предназначен для поля MultiValueField.\r\n\r\nКласс MultiWidget имеет один обязательный аргумент:\r\n\r\nwidgets\r\nИтератор, содержащий необходимые виджеты.\r\n\r\nИ один обязательный метод:\r\n\r\ndecompress(value)\r\nЭтот метод принимает единственное “сжато” значение от поля и возвращает список “распакованных” значений. Введённое значение может считаться верным, но не обязательно не пустым.\r\n\r\nЭтот метод должен быть реализован в дочернем классе и, так как значение может быть пустым, реализация должна проверять этот момент.\r\n\r\nНаличие “распаковки” объясняется необходимостью “разделить” объединённое значение поля формы на значения для каждого виджета.\r\n\r\nПример того как SplitDateTimeWidget преобразовывает значение datetime в список с датой и временем:\r\n\r\nfrom django.forms import MultiWidget\r\n\r\nclass SplitDateTimeWidget(MultiWidget):\r\n\r\n    # ...\r\n\r\n    def decompress(self, value):\r\n        if value:\r\n            return [value.date(), value.time().replace(microsecond=0)]\r\n        return [None, None]\r\nСовет\r\nСледует отметить, что MultiValueField обладает дополнительным методом compress() с обратной функциональностью – объединять проверенные значения всех элементов поля в единое значение.\r\nСписок других методов, которые может быть полезно переопределить:\r\n\r\nrender(name, value, attrs=None)\r\nАргумент value обрабатывается по-другому в этом методе в отличие от дочерних классов Widget, потому что он должен знать как именно разделять единое значение для отображения во множестве виджетов.\r\n\r\nАргумент value, используемый при генерации, может быть одним из:\r\n\r\nСписок (list).\r\n\r\nЕдинственное значение (т.е., строка), которая является “сжатым” представлением списка значений.\r\n\r\nЕсли value является списком, результатом метода render() будет совокупность отрендеренных виджетов. Если value не является списком, то сначала оно будет обработано методом decompress() для получения списка и затем выполнится рендеринг.\r\n\r\nПри работе метода render() каждому значению в списке назначается соответствующий виджет. Первое значение значение назначается первому виджету, второе – второму и так далее.\r\n\r\nВ отличие от виджетов с единственным значением, метод render() не обязательно должен быть реализован в дочерних классах.\r\n\r\nformat_output(rendered_widgets)\r\nПереданный список отрендеренных виджетов (в виде строки), возвращает строку Unicode, представляющую HTML код для всего этого.\r\n\r\nЭтот обработчик позволяет вам форматировать HTML код виджетов в нужном вам виде.\r\n\r\nНиже приведён виджет унаследован от MultiWidget и подходит для отображения даты, разделяя день, месяц и год по различным элементам. Этот виджет предназначен для использования совместно с DateField вместо MultiValueField, следовательно мы должны реализовать метод value_from_datadict():\r\n\r\nfrom datetime import date\r\nfrom django.forms import widgets\r\n\r\nclass DateSelectorWidget(widgets.MultiWidget):\r\n    def __init__(self, attrs=None):\r\n        # create choices for days, months, years\r\n        # example below, the rest snipped for brevity.\r\n        years = [(year, year) for year in (2011, 2012, 2013)]\r\n        _widgets = (\r\n            widgets.Select(attrs=attrs, choices=days),\r\n            widgets.Select(attrs=attrs, choices=months),\r\n            widgets.Select(attrs=attrs, choices=years),\r\n        )\r\n        super(DateSelectorWidget, self).__init__(_widgets, attrs)\r\n\r\n    def decompress(self, value):\r\n        if value:\r\n            return [value.day, value.month, value.year]\r\n        return [None, None, None]\r\n\r\n    def format_output(self, rendered_widgets):\r\n        return ''.join(rendered_widgets)\r\n\r\n    def value_from_datadict(self, data, files, name):\r\n        datelist = [\r\n            widget.value_from_datadict(data, files, name + '_%s' % i)\r\n            for i, widget in enumerate(self.widgets)]\r\n        try:\r\n            D = date(\r\n                day=int(datelist[0]),\r\n                month=int(datelist[1]),\r\n                year=int(datelist[2]),\r\n            )\r\n        except ValueError:\r\n            return ''\r\n        else:\r\n            return str(D)\r\nКонструктор создаёт кортеж из нескольких виджетов Select. Класс, от которого был унаследован виджет, использует этот кортеж для настройки виджета.\r\n\r\nМетод format_output() не особо нужен здесь (действительно, он похож на стандартную реализацию этого метода в MultiWidget), но идея в том, что вы можете в этой точке можете сделать нужную настройку виджетов.\r\n\r\nОбязательный метод decompress() разбивает значение datetime.date на значение дня, месяца и года для каждого виджета. Следует отметить, что метод обрабатывает случай, когда value равно None.\r\n\r\nСтандартная реализация метода value_from_datadict() возвращает список значений для каждого Widget. Это полезно при использовании MultiWidget совместно с MultiValueField, но так как мы желаем использовать этот виджет совместно с DateField, который принимает единственное значение, мы переопределили этот метод для соединения данных всех подчинённых виджетов в datetime.date. Метод получает данные из словаря POST, создаёт и проверяет дату. Если она проходит проверку, мы возвращаем строку, в противном случае возвращаем пустую строку, что заставляет form.is_valid вернуть False.", "date": "2016-09-10T16:21:29Z", "likes": 0, "tags": [1]}}, {"model": "article.article", "pk": 3, "fields": {"title": "Встроенные виджеты", "text": "Django с помощью модуля django.forms.widgets обеспечивает представление для всех базовых HTML виджетов, а также некоторые часто используемые группы виджетов, включая виджеты для ввода текста, различные чекбоксы и селекторы, загрузку файлов и обработку сложных значений.\r\n\r\nВиджеты для ввода текста\r\nЭти виджеты используют HTML элементы input и textarea.\r\n\r\nTextInput\r\nclass TextInput\r\nВвод текста: <input type=\"text\" ...>\r\n\r\nNumberInput\r\nclass NumberInput\r\nВвод текста: <input type=\"number\" ...>\r\n\r\nБудьте осторожны, не все браузеры поддерживают локализированные числа в полях типа number. Django, не надеясь на браузер, использует для localize значение True.\r\n\r\nEmailInput\r\nclass EmailInput\r\nВвод текста: <input type=\"email\" ...>\r\n\r\nURLInput\r\nclass URLInput\r\nВвод текста: <input type=\"url\" ...>\r\n\r\nPasswordInput\r\nclass PasswordInput\r\nВвод пароля: <input type='password' ...>\r\n\r\nПринимает один необязательный аргумент:\r\n\r\nrender_value\r\nОпределяет, надо ли заполнять этот виджет при повторном отображении формы при ошибке (по умолчанию False).\r\n\r\nHiddenInput\r\nclass HiddenInput\r\nСкрытый ввод: <input type='hidden' ...>\r\n\r\nСледует отметить, что также существует виджет MultipleHiddenInput, который объединяет элементы скрытого ввода.\r\n\r\nDateInput\r\nclass DateInput\r\nВвод даты в простое текстовое поле: <input type='text' ...>\r\n\r\nПринимает аргументы, аналогичные TextInput, лишь с одним необязательным аргументом:\r\n\r\nformat\r\nФормат, в котором отображается начальное значение поля.\r\n\r\nЕсли аргумент format не предоставлен, то стандартный формат берется из DATE_INPUT_FORMATS с учетом Формат локализации.\r\n\r\nDateTimeInput\r\nclass DateTimeInput\r\nВвод даты/времени в простое текстовое поле: <input type='text' ...>\r\n\r\nПринимает аргументы, аналогичные TextInput, лишь с одним необязательным аргументом:\r\n\r\nformat\r\nФормат, в котором отображается начальное значение поля.\r\n\r\nЕсли аргумент format не предоставлен, то стандартный формат берется из DATETIME_INPUT_FORMATS с учетом Формат локализации.\r\n\r\nПо умолчанию микросекунды значения всегда устанавливаются в 0. Если микросекунды необходимы, наследуйтесь от этого класса и установите атрибут supports_microseconds в True.\r\n\r\nTimeInput\r\nclass TimeInput\r\nВвод времени в простое текстовое поле: <input type='text' ...>\r\n\r\nПринимает аргументы, аналогичные TextInput, лишь с одним необязательным аргументом:\r\n\r\nformat\r\nФормат, в котором отображается начальное значение поля.\r\n\r\nЕсли аргумент format не предоставлен, то стандартный формат берется из TIME_INPUT_FORMATS с учетом Формат локализации.\r\n\r\nПодробности об обработке микросекунд смотрите в описании DateTimeInput.\r\n\r\nTextarea\r\nclass Textarea\r\nТекстовая область: <textarea>...</textarea>\r\n\r\nВиджеты выбора и отметки\r\nCheckboxInput\r\nclass CheckboxInput\r\nЧекбокс: <input type='checkbox' ...>\r\n\r\nПринимает один необязательный аргумент:\r\n\r\ncheck_test\r\nФункция, которая принимает значение CheckboxInput и возвращает True, если указанное значение было отмечено на элементе.", "date": "2016-09-10T16:22:07Z", "likes": 0, "tags": [1]}}, {"model": "article.article", "pk": 4, "fields": {"title": "Сложные виджеты", "text": "MultipleHiddenInput\r\nclass MultipleHiddenInput\r\nМножество виджетов``<input type=’hidden’ ...>``.\r\n\r\nВиджет, который обрабатывает множество скрытых виджетов для полей, которые содержат список значений.\r\n\r\nchoices\r\nЭтот атрибут является необязательным, если поле не имеет атрибут choices. В противном случае, его содержимое имеет преимущество над атрибутами Field.\r\n\r\nSplitDateTimeWidget\r\nclass SplitDateTimeWidget\r\nОбёртка (MultiWidget с помощью) вокруг двух виджетов: DateInput для даты и TimeInput для времени.\r\n\r\nSplitDateTimeWidget имеет два необязательных атрибута:\r\n\r\ndate_format\r\nАналогичен DateInput.format.\r\n\r\ntime_format\r\nАналогичен TimeInput.format.\r\n\r\nSplitHiddenDateTimeWidget\r\nclass SplitHiddenDateTimeWidget\r\nАналогичен SplitDateTimeWidget, но используется HiddenInput для даты и времени.\r\n\r\nSelectDateWidget\r\nclass SelectDateWidget\r\nОбёртка вокруг трёх виджетов Select – месяц, день и год.\r\n\r\nПринимает несколько необязательных аргументов:\r\n\r\nyears\r\nНеобязательный список/кортеж с вариантами года. По умолчанию содержит текущий год и девять последующих.\r\n\r\nmonths\r\nНеобязательный словарь списка месяцев.\r\n\r\nКлюч словаря соответствует номеру месяца (начиная с 1), значения – отображаемое название:\r\n\r\nMONTHS = {\r\n    1:_('jan'), 2:_('feb'), 3:_('mar'), 4:_('apr'),\r\n    5:_('may'), 6:_('jun'), 7:_('jul'), 8:_('aug'),\r\n    9:_('sep'), 10:_('oct'), 11:_('nov'), 12:_('dec')\r\n}\r\nempty_label\r\nNew in Django 1.8.\r\nЕсли поле DateField не обязательно, SelectDateWidget будет содержать пустое значение в начале списка (по умолчанию ---). Вы можете поменять название элемента с помощью атрибута empty_label. empty_label принимает string, list, или tuple. Если указана строка, каждый <select> будет содержать пустое значение. Если empty_label содержит list или tuple из 3-х строк – для каждого <select> будет использоваться свое значение. Элементы используются в следующем порядке: ('year_label', 'month_label', 'day_label').\r\n\r\n# A custom empty label with string\r\nfield1 = forms.DateField(widget=SelectDateWidget(empty_label=\"Nothing\"))\r\n\r\n# A custom empty label with tuple\r\nfield1 = forms.DateField(\r\n    widget=SelectDateWidget(\r\n        empty_label=(\"Choose Year\", \"Choose Month\", \"Choose Day\"),\r\n    ),\r\n)\r\nChanged in Django 1.9:\r\nЭтот виджет раньше находился в пакете django.forms.extras.widgets. Теперь находится в django.forms.widgets и, как и другие виджеты, может быть импортирован из django.forms.", "date": "2016-09-10T16:22:46Z", "likes": 0, "tags": [1]}}, {"model": "article.article", "pk": 5, "fields": {"title": "Модели", "text": "Модели отображают информацию о данных, с которыми вы работаете. Они содержат поля и поведение ваших данных. Обычно одна модель представляет одну таблицу в базе данных.\r\n\r\nОсновы:\r\n\r\nКаждая модель это класс унаследованный от django.db.models.Model.\r\n\r\nАтрибут модели представляет поле в базе данных.\r\n\r\nDjango предоставляет автоматически созданное API для доступа к данным; смотрите Выполнение запросов.\r\n\r\nПримеры\r\n\r\nВот пример модели, которая определяет гипотетического человека(Person), с именем(first_name) и фамилией(last_name):\r\n\r\nfrom django.db import models\r\n\r\nclass Person(models.Model):\r\n    first_name = models.CharField(max_length=30)\r\n    last_name = models.CharField(max_length=30)\r\nfirst_name и last_name поля модели. Каждое поле определено как атрибут класса, и каждый атрибут соответствует полю таблицы в базе данных.\r\n\r\nМодель Person создаст в базе данных таблицу:\r\n\r\nCREATE TABLE myapp_person (\r\n    \"id\" serial NOT NULL PRIMARY KEY,\r\n    \"first_name\" varchar(30) NOT NULL,\r\n    \"last_name\" varchar(30) NOT NULL\r\n);\r\nТехнические замечания:\r\n\r\nНазвание таблицы, myapp_person, автоматически создано с метаданных модели и может быть переопределено. Подробнее Название таблицы.\r\n\r\nПоле id добавлено автоматически, но его также можно переопределить. Подробнее Первичный ключ по умолчанию.\r\n\r\nCREATE TABLE SQL в этом примере соответствует синтаксису PostgreSQL, но стоит учесть что Django использует синтаксис SQL соответственно настройкам базы данных в файле настроек.\r\n\r\nИспользование моделей\r\n\r\nПосле определения моделей необходимо указать Django что необходимо их использовать. Сделайте это отредактировав файл настроек и изменив INSTALLED_APPS, добавив пакет, который содержит ваш models.py.\r\n\r\nНапример, если модели вашего приложения находятся в myapp.models (структура пакетов создана с помощью команды создания приложения manage.py startapp), INSTALLED_APPS должен содержать:\r\n\r\nINSTALLED_APPS = [\r\n    #...\r\n    'myapp',\r\n    #...\r\n]\r\nПосле добавления приложения в INSTALLED_APPS, не забудьте выполнить manage.py migrate. Возможно, нужно будет создать сначала миграции, выполнив manage.py makemigrations.\r\n\r\nПоля\r\n\r\nСамая важная часть модели – и единственная обязательная – это список полей таблицы базы данных которые она представляет. Поля определены атрибутами класса. Нельзя использовать имена конфликтующие с API моделей, такие как clean, save или delete.\r\n\r\nПример:\r\n\r\nfrom django.db import models\r\n\r\nclass Musician(models.Model):\r\n    first_name = models.CharField(max_length=50)\r\n    last_name = models.CharField(max_length=50)\r\n    instrument = models.CharField(max_length=100)\r\n\r\nclass Album(models.Model):\r\n    artist = models.ForeignKey(Musician, on_delete=models.CASCADE)\r\n    name = models.CharField(max_length=100)\r\n    release_date = models.DateField()\r\n    num_stars = models.IntegerField()\r\nТипы полей\r\nКаждое поле в вашей модели должно быть экземпляром соответствующего Field класса. Django использует классы полей для определения такой информации:\r\n\r\nТипа колонки в базе данных (например: INTEGER, VARCHAR).\r\n\r\nВиджет используемый при создании поля формы (например: <input type=\"text\">, <select>).\r\n\r\nМинимальные правила проверки данных, используемые в интерфейсе администратора и для автоматического создания формы.\r\n\r\nВ Django есть большое количество полей; полный список можно посмотреть на странице списка полей. Вы можете легко добавить собственное поле; смотрите Создание собственных полей для модели.\r\n\r\nНастройка полей\r\nДля каждого поля есть набор предопределенных аргументов (описание на странице описания полей). Например, CharField (и унаследованные от него) имеют обязательный аргумент max_length, который определяет размер поля VARCHAR для хранения данных этого поля.\r\n\r\nТакже есть список стандартных аргументов для всех полей. Все они не обязательны. Все они описаны в разделе про аргументы полей модели, вот список самых используемых:\r\n\r\nnull\r\nЕсли True, Django сохранит пустое значение как NULL в базе данных. По умолчанию - False.\r\n\r\nblank", "date": "2016-09-10T18:09:02Z", "likes": 0, "tags": [1]}}, {"model": "article.article", "pk": 6, "fields": {"title": "Первичный ключ по умолчанию", "text": "По умолчанию Django для каждой модели добавляет такое поле:\r\n\r\nid = models.AutoField(primary_key=True)\r\nЭто автоинкрементный первичный ключ.\r\n\r\nДля его переопределения просто укажите primary_key=True для одного из полей. При этом Django не добавит поле id.\r\n\r\nКаждая модель должна иметь хотя бы одно поле с primary_key=True (явно указанное или созданное автоматически).\r\n\r\nЧитабельное имя поля\r\nКаждое поле, кроме ForeignKey, ManyToManyField и OneToOneField, первым аргументом принимает необязательное читабельное название. Если оно не указано, Django самостоятельно создаст его, используя название поля, заменяя подчеркивание на пробел.\r\n\r\nВ этом примере читабельное название - \"person's first name\":\r\n\r\nfirst_name = models.CharField(\"person's first name\", max_length=30)\r\nЗдесь - \"first name\":\r\n\r\nfirst_name = models.CharField(max_length=30)\r\nForeignKey, ManyToManyField и OneToOneField первым аргументом принимает класс модели, поэтому используется keyword аргумент verbose_name:\r\n\r\npoll = models.ForeignKey(\r\n    Poll,\r\n    on_delete=models.CASCADE,\r\n    verbose_name=\"the related poll\",\r\n)\r\nsites = models.ManyToManyField(Site, verbose_name=\"list of sites\")\r\nplace = models.OneToOneField(\r\n    Place,\r\n    on_delete=models.CASCADE,\r\n    verbose_name=\"related place\",\r\n)\r\nDjango не делает первую букву прописной для verbose_name - только там, где это необходимо.\r\n\r\nСвязи\r\nОсновное преимущество реляционных баз данных - возможность добавлять связи для таблиц. Django предоставляет возможность использовать три самых используемых типа связей: многое-к-одному, многие-ко-многим и один-к-одному.\r\n\r\nСвязь многое-к-одному\r\nДля определения связи многое-к-одному используется django.db.models.ForeignKey. Вы используете его так же, как и другие типы Field: добавляя как атрибут в модель.\r\n\r\nДля ForeignKey необходимо указать обязательный позиционный аргумент: класс связанной модели.\r\n\r\nНапример, если модель Car содержит информацию о Manufacturer – это отношение многое-к-одному. Manufacturer производит много Car, которая связана только с одной Manufacturer – используйте следующее определение:\r\n\r\nfrom django.db import models\r\n\r\nclass Manufacturer(models.Model):\r\n    # ...\r\n    pass\r\n\r\nclass Car(models.Model):\r\n    manufacturer = models.ForeignKey(Manufacturer, on_delete=models.CASCADE)\r\n    # ...\r\nВы можете также создать рекурсивную связь (объект со связью многое-к-одному на себя) и связь с моделью, которая еще не определена; смотрите справку по полям модели для подробностей.\r\n\r\nЖелательно, но не обязательно, чтобы название ForeignKey поля (manufacturer в примере выше) было названием модели в нижнем регистре. Конечно же вы можете назвать поле, как вам угодно. Например:\r\n\r\nclass Car(models.Model):\r\n    company_that_makes_it = models.ForeignKey(\r\n        Manufacturer,\r\n        on_delete=models.CASCADE,\r\n    )\r\n    # ...\r\nСм.также\r\nForeignKey принимает дополнительные аргументы, смотрите справку по полям модели. Эти аргументы определяют, как работает связь, все они не обязательны.\r\n\r\nПример работы с обратно-связанными объектами смотрите в в соответствующем разделе.\r\n\r\nПримеры кода можно найти в соответствующем разделе.\r\nСвязь много-ко-многому\r\nДля определения связи многие-ко-многим, используйте ManyToManyField. Используется так же, как и остальные типы Field: добавлением как атрибут класса.\r\n\r\nДля ManyToManyField необходимо указать обязательный позиционный аргумент: класс связанной модели.\r\n\r\nНапример, если пицца(Pizza) содержит много добавок(Topping) – то есть добавки(Topping) могут быть в различных сортах пиццы(Pizza) – вот как вы можете представить это:\r\n\r\nfrom django.db import models\r\n\r\nclass Topping(models.Model):\r\n    # ...\r\n    pass\r\n\r\nclass Pizza(models.Model):\r\n    # ...\r\n    toppings = models.ManyToManyField(Topping)\r\nТак же, как и с ForeignKey, вы можете создать рекурсивную связь (объект со связью многие-ко-многим на себя) и связь с моделью, которая еще неопределенна; смотрите справку по полям модели.\r\n\r\nЖелательно, но не обязательно, чтобы название поля ManyToManyField (toppings в нашем примере) было множественным называнием связанных объектов.\r\n\r\nНе имеет значения какая модель содержит поле ManyToManyField, но вы должны добавить его только для одной модели.\r\n\r\nОбычно, ManyToManyField необходимо добавить в модель, которая будет редактироваться в форме. В примере выше, toppings добавлено в Pizza (вместо того, чтобы добавить поле pizzas типа ManyToManyField в модель Topping), потому что обычно думают о пицце с ингредиентами, а не об ингредиентах в различных пиццах. В примере выше, форма для Pizza позволит пользователям редактировать ингредиенты для пиццы.\r\n\r\nСм.также\r\nПримеры использования связи многие-ко-многим можно найти в соответствующем разделе\r\nПоле ManyToManyField принимает список дополнительных аргументов, подробнее в разделе справки о полях модели. Эти настройки помогают определить как работает связь, все они не обязательны.\r\n\r\nДополнительные поля для связи многие-ко-многим\r\nВ примере про пиццу нам нужно было всего лишь указать ингредиенты для пиццы, и поля ManyToManyField было достаточно для этого. Но иногда необходимо хранить дополнительную информацию о связи.\r\n\r\nНапример, разберем приложение о музыкальных группах и музыкантах. Для хранения связи между музыкантами и группами мы можем использовать поле ManyToManyField. Но нам также необходимо хранить дополнительную информацию, например, когда музыкант вступил в группу.\r\n\r\nДля таких случаев Django позволяет определить модель для хранения связи многие-ко-многим и дополнительной информации. Теперь вы можете добавить дополнительные поля в эту модель. Эту промежуточную модель можн", "date": "2016-09-10T18:09:41Z", "likes": 0, "tags": [1]}}, {"model": "article.article", "pk": 7, "fields": {"title": "Связь моделей из разных модулей", "text": "Нормальная практика использовать связи для моделей из разных приложений. Для этого, импортируйте связанную модель перед определением главной модели и используйте как аргумент для поля. Например:\r\n\r\nfrom django.db import models\r\nfrom geography.models import ZipCode\r\n\r\nclass Restaurant(models.Model):\r\n    # ...\r\n    zip_code = models.ForeignKey(\r\n        ZipCode,\r\n        on_delete=models.SET_NULL,\r\n        blank=True,\r\n        null=True,\r\n    )\r\nОграничения при выборе названия поля\r\nВ Django существует только два ограничения:\r\n\r\nНазвание поля не может быть слово зарезервированное Python, т.к. это приведет к синтаксической ошибке. Например:\r\n\r\nclass Example(models.Model):\r\n    pass = models.IntegerField() # 'pass' is a reserved word!\r\nНазвание поля не может содержать несколько нижних подчеркиваний(_) подряд, т.к. такой подход Django использует для формирования запросов. Например:\r\n\r\nclass Example(models.Model):\r\n    foo__bar = models.IntegerField() # 'foo__bar' has two underscores!\r\nЭти ограничения не сложно соблюдать т.к. название поля не обязано быть таким же, как и название колонки в базе данных. Смотрите аргумент db_column.\r\n\r\nЗарезервированные SQL слова, такие как join, where или select, можно использовать как название поля, потому что Django экранирует название таблиц и полей для каждого SQL запроса. Используются “кавычки”(quoting syntax) базы данных, которую вы используете.\r\n\r\nСобственные типы полей\r\nЕсли ни одно существующее поле не удовлетворяет вашим потребностям, или вам необходимо использовать какие-либо особенности поля, присущие определенной базе данных - вы можете создать собственный тип поля. Подробнее вы можете прочитать в Создание собственных полей для модели.\r\n\r\nМета-настройки\r\n\r\nДополнительные настройки для модели можно определить через class Meta, например:\r\n\r\nfrom django.db import models\r\n\r\nclass Ox(models.Model):\r\n    horn_length = models.IntegerField()\r\n\r\n    class Meta:\r\n        ordering = [\"horn_length\"]\r\n        verbose_name_plural = \"oxen\"\r\nСюда включено “все что не является полем”, например, настройка сортировки по-умолчанию (ordering), название таблицы базы данных (db_table), или human-readable название в единственной и множественной форме(verbose_name и verbose_name_plural). Все они не обязательны и добавлять class Meta тоже не обязательно.\r\n\r\nПолный список опций для Meta можно найти в разделе о настройках модели.\r\n\r\nАтрибуты модели\r\n\r\nobjects\r\nСамый важный атрибут модели – Manager. Это интерфейс, через который Django выполняет запросы к базе данных и получает объекты. Если собственный Manager не указан, название по умолчанию будет objects. Менеджеры доступны только через класс модели, они не доступны в экземплярах модели.\r\n\r\nМетоды модели\r\n\r\nДля добавления функционала работы с экземпляром модели(“row-level” functionality), необходимо просто добавить метод в модель. В то время, как методы Manager работают с таблицей, методы модели работают с конкретной записью в таблице.", "date": "2016-09-10T18:10:15Z", "likes": 0, "tags": [1]}}, {"model": "article.article", "pk": 8, "fields": {"title": "Наследование моделей", "text": "Наследование моделей в Django работает почти так же, как и наследование классов в Python, но следует соблюдать правила, описанные выше. Это означает, что базовый класс должен наследоваться от django.db.models.Model.\r\n\r\nЕдинственное, что вам нужно определить, это должна ли родительская модель быть независимой моделью (с собственной таблицей в базе данных), или же родительская модель просто контейнер для хранения информации, доступной только через дочерние модели.\r\n\r\nСуществует три вида наследования моделей в Django.\r\n\r\nЧаще всего вы будете использовать родительскую модель для хранения общих полей, чтобы не добавлять их в каждую дочернюю модель. Если вы не собираетесь использовать его как независимую модель – Абстрактные модели то, что вам нужно.\r\n\r\nЕсли родительская модель независимая(возможно, из другого приложения) и должна храниться в отдельной таблице, Multi-table наследование то, что вам нужно.\r\n\r\nЕсли же вы хотите переопределить поведение модели на уровне Python, не меняя структуры базы данных, вы можете использовать Proxy-модели.\r\n\r\nАбстрактные модели\r\nАбстрактные модели удобны при определении общих, для нескольких моделей, полей. Вы создаете базовую модель и добавляете abstract=True в класс Meta. Для этой модели не будет создана таблица в базе данных. Используя эту модель как родительскую для другой модели - все ее поля будут добавлены в таблицу в базе данных для этой модели. Нельзя использовать поля с одинаковыми названиями в дочерней и родительской моделях (Django вызовет исключение).\r\n\r\nНапример:\r\n\r\nfrom django.db import models\r\n\r\nclass CommonInfo(models.Model):\r\n    name = models.CharField(max_length=100)\r\n    age = models.PositiveIntegerField()\r\n\r\n    class Meta:\r\n        abstract = True\r\n\r\nclass Student(CommonInfo):\r\n    home_group = models.CharField(max_length=5)\r\nМодель Student содержит три поля: name, age и home_group. Модель CommonInfo не может использоваться как обычная модель Django, т.к. это абстрактный класс. Она не имеет собственной таблицы в базе данных и не имеет менеджера, нельзя создать экземпляр модели и сохранить его в базе данных.\r\n\r\nВ большинстве случаев вы будете использовать этот тип наследования моделей. Он позволяет на уровне Python разделить общие данные, используя в то же время одну таблицу в базе данных.\r\n\r\nНаследование класса Meta\r\nПосле создания абстрактной модели, Django добавляет класс Meta как атрибут класса. Если дочерний класс не определяет собственный класс Meta, он унаследует родительский класс Meta. Если дочерняя модель хочет расширить родительский Meta класс, она может унаследовать его. Например:\r\n\r\nfrom django.db import models\r\n\r\nclass CommonInfo(models.Model):\r\n    # ...\r\n    class Meta:\r\n        abstract = True\r\n        ordering = ['name']\r\n\r\nclass Student(CommonInfo):\r\n    # ...\r\n    class Meta(CommonInfo.Meta):\r\n        db_table = 'student_info'\r\nDjango делает одно изменение в Meta для абстрактной модели: перед добавлением в модель изменяет атрибут abstract=False. Это означает что дочерняя модель, наследуя Meta, не становится сама абстрактной моделью. Конечно вы можете создать абстрактную модель, которая наследуется от другой абстрактной модели. Вам только нужно определить атрибут abstract=True.\r\n\r\nНекоторые атрибуты не имеет смысла добавлять в класс Meta абстрактной модели. Например, добавление db_table означает, что каждая дочерняя модель(каждая, которая не определяет свой собственный класс Meta) будет использовать туже таблицу в базе данных, что точно не то, что вам нужно.\r\n\r\nОсторожно с related_name\r\nИспользуя атрибут related_name для ForeignKey или ManyToManyField, вы должны всегда определять уникальное название для обратной связи. Это одна из проблем абстрактных моделей, т.к. ее поля будут добавлены в каждой из дочерних моделей, с теми же значениями аргументов (включая related_name).\r\n\r\nДля решения этой проблемы, добавляя related_name для абстрактной модели (и только для абстрактной), можно использовать в названии '%(app_label)s' и '%(class)s'.\r\n\r\n'%(class)s' будет заменен на название дочерней модели, в которой поле используется, в нижнем регистре.\r\n\r\n'%(app_label)s' будет заменено на название приложения, в котором находится модель, в нижнем регистре. Название приложения должно быть уникальным, так же, как и название модели в приложении, в результате получится уникальное значение атрибута.\r\n\r\nНапример, есть приложение с common/models.py:\r\n\r\nfrom django.db import models\r\n\r\nclass Base(models.Model):\r\n    m2m = models.ManyToManyField(OtherModel, related_name=\"%(app_label)s_%(class)s_related\")\r\n\r\n    class Meta:\r\n        abstract = True\r\n\r\nclass ChildA(Base):\r\n    pass\r\n\r\nclass ChildB(Base):\r\n    pass\r\nИ еще другое rare/models.py:\r\n\r\nfrom common.models import Base\r\n\r\nclass ChildB(Base):\r\n    pass\r\nИмя обратной связи поля common.ChildA.m2m будет common_childa_related, в то время как для common.ChildB.m2m будет common_childb_related, а для rare.ChildB.m2m - rare_childb_related. Вы можете использовать '%(class)s' и '%(app_label)s как вам угодно для создания названия, но если вы забудете о них, Django вызовет исключение при проверке проекта (или при migrate).\r\n\r\nНе указав related_name для абстрактной модели, для обратной связи будет использовано название дочерней модели плюс '_set', так же, как при добавлении связи непосредственно в дочернюю модель. Например, в примере выше, без указания related_name название для обратной связи поля m2m будет childa_set для модели ChildA и childb_set для ChildB.\r\n\r\nMulti-table наследование\r\nЭто второй тип наследования в Django - когда каждая модель в иерархии будет независимой. Каждая модель имеет собственную таблицу в базе данных и может быть использована независимо. Наследование использует связь между родительской и дочерней моделью (через автоматически созданное поле OneToOneField). Например:\r\n\r\nfrom django.db import models\r\n\r\nclass Place(models.Model):\r\n    name = models.CharField(max_length=50)\r\n    address = models.CharField(max_length=80)\r\n\r\nclass Restaurant(Place):\r\n    serves_hot_dogs = models.BooleanField(default=False)\r\n    serves_pizza = models.BooleanField(default=False)\r\nВсе поля Place будут доступны и в Restaurant, в то время как данные будут храниться в разных таблицах. Например:\r\n\r\n>>> Place.objects.filter(name=\"Bob's Cafe\")\r\n>>> Restaurant.objects.filter(name=\"Bob's Cafe\")\r\nЕсли объект Place является одновременно и Restaurant, вы можете из объекта Place получить связанный объект Restaurant, используя название модели в нижнем регистре:\r\n\r\n>>> p = Place.objects.get(id=12)\r\n# If p is a Restaurant object, this will give the child class:\r\n>>> p.restaurant\r\n<Restaurant: ...>\r\nНо, если p в примере выше не Restaurant (был создан непосредственно как объект Place или был родителем другой модели), использование p.restaurant вызовет ошибку Restaurant.DoesNotExist.\r\n\r\nMeta и multi-table наследование\r\nПри multi-table наследовании, не имеет смысла дочерней модели наследовать Meta от родительской. Все атрибуты класса Meta уже используются в родительской модели и использование их снова может привести к противоречивому поведению (это отличие от абстрактной модели, которая сама по себе не существует как независимая модель).\r\n\r\nПоэтому дочерняя модель не имеет доступа к родительскому классу Meta. Но есть исключения, когда дочерняя модель наследует поведение родительской: если дочерняя модель не определяет атрибут ordering или get_latest_by, они будут унаследованы.\r\n\r\nЕсли родительская модель определяет сортировку, но вы не хотите ее наследовать в дочерней модели, вы можете указать это таким способом:\r\n\r\nclass ChildModel(ParentModel):\r\n    # ...\r\n    class Meta:\r\n        # Remove parent's ordering effect\r\n        ordering = []\r\nНаследование и обратные связи\r\nТ.к. multi-table наследование использует OneToOneField для связи родительской и дочерней модели, возможно из родительской модели получить дочернюю, как это показано в примере выше. Используется название по умолчанию для атрибута related_name в ForeignKey и ManyToManyField. Если вы используете такие связи на дочернюю модель с аналогичным предком, вы должны определить related_name для каждого такого поля. Иначе Django вызовет исключение.\r\n\r\nНапример, используя Place определенную выше, создадим еще одну дочернюю модель с ManyToManyField:\r\n\r\nclass Supplier(Place):\r\n    customers = models.ManyToManyField(Place)\r\nЭто приведет к ошибке:\r\n\r\nReverse query name for 'Supplier.customers' clashes with reverse query\r\nname for 'Supplier.place_ptr'.\r\n\r\nHINT: Add or change a related_name argument to the definition for\r\n'Supplier.customers' or 'Supplier.place_ptr'.\r\nДобавление related_name для поля customers – models.ManyToManyField(Place, related_name='provider') – решит эту проблему.\r\n\r\nОпределение связи к родительской модели\r\nКак уже упоминалось, Django самостоятельно создает OneToOneField для связи дочерней модели с каждой родительской не абстрактной моделью. Если вы хотите определять имя обратной связи для родительской модели, вы можете создать собственный OneToOneField с parent_link=True чтобы указать, что это поле является связью с родительской моделью.\r\n\r\nProxy-модели\r\nПри использовании multi-table наследования, будет создана новая таблица в базе данных. Это обязательное требование, т.к. д", "date": "2016-09-10T18:13:34Z", "likes": 0, "tags": [1]}}]